Revit 2024 API
ParameterTypeId.MaterialAssetParamCommonSharedAsset Property
 "Sharing"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId MaterialAssetParamCommonSharedAsset { get; }
Visual Basic
Public Shared ReadOnly Property MaterialAssetParamCommonSharedAsset As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MaterialAssetParamCommonSharedAsset {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace